app/controllers/tickets_controller.rb

SELECT `tickets`.* FROM `tickets` WHERE `tickets`.`status` = 'Waiting for Staff Response'
---
  def index
    @tickets = Ticket.all(conditions: {status: params[:status]})

INSERT INTO `tickets` (`body`, `created_at`, `department`, `email`, `name`, `owner`, `reply`, `status`, `subject`, `updated_at`) VALUES ('I want to ask you some questions', '2012-11-16 12:16:46', 'Information Security', 'dmitriy.tsaregradtsev@gmail.com', 'Dmitry', NULL, NULL, 'Waiting for Staff Response', 'Hello World', '2012-11-16 12:16:46')
---
  def create
    @ticket = Ticket.new(params[:ticket])
    if @ticket.save

SELECT `tickets`.* FROM `tickets` WHERE `tickets`.`id` = 1 LIMIT 1
---
  def edit
    @ticket = Ticket.find(params[:id])

SELECT `tickets`.* FROM `tickets` WHERE `tickets`.`id` = 1 LIMIT 1
UPDATE `tickets` SET `status` = 'On Hold', `owner` = 'Information Security', `reply` = 'Don\'t worry about your personal information, we ...', `updated_at` = '2012-11-16 12:29:17' WHERE `tickets`.`id` = 1
---
  def update
    @ticket = Ticket.find(params[:id])

    if @ticket.update_attributes(params[:ticket])